test_examples/tube_OpenFoam3d_abaqus3d/CFD_Own_test_parallel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.00011;

deltaT          0.00001;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions{
	wallShearStress
	{
            type        wallShearStress;
            libs ("libfieldFunctionObjects.so");

	    // Optional entries (runtime modifiable)
	    patches         (mantle); 

	    // Optional (inherited) entries
	    writePrecision  8;
	    writeToFile     true;
	    writeControl    timeStep;
	    writeInterval   1;
            log 	    true;

	}

	surfaceRegion1
	{
		libs ("libfieldFunctionObjects.so");
        	log             yes;
        	writeFields     true;
        	surfaceFormat   foamFile;
        	regionType      patch;
		name 		mantle;
        	operation       none;
        	fields
        	(
            		p
			wallShearStress
        	);

	    type surfaceRegion;
            libs ("libfieldFunctionObjects.so");

            // Optional entries (runtime modifiable)
            patches         ("mantle");

            // Optional (inherited) entries
            writePrecision  8;
            writeToFile     true;
            writeControl    timeStep;
            writeInterval   1;
            log             true;

	}
}
// ************************************************************************* //
